{
    "data_paths": "[../dataset/train_description_claim]",
    "output_dir": "../llama3-8b-claim",
    "tb_dir": "../tb_dir",
    "pretrained_model_path": "../../Meta-Llama-3-8B-Instruct-hf/",
    "model_type": "llama",
    "load_raw_dataset": true,
    "data_split": "90,10,0",
    "padding_mode": "padding",
    "use_dynamic_padding": true,
    "tokenize_mode": "sft",
    "tokenizer_type": "AutoTokenizer",
    "weighted_loss_mode": "case3",
    "attn_implementation": "eager",
    "seq_length": 8192,
    "seed": 1234,
    "peft_type": "lora",
    "quantization": null,
    "lora_rank": 96,
    "lora_alpha": 32,
    "lora_dropout": 0.05,
    "per_device_train_batch_size": 1,
    "per_device_eval_batch_size": 1,
    "learning_rate": 5e-5,
    "min_lr": 5e-6,
    "weight_decay": 0.1,
    "gradient_accumulation_steps": 4,
    "lr_scheduler_type": "cosine",
    "num_warmup_steps": 200,
    "num_train_epochs": 5,
    "resume_from_checkpoint": null,
    "log_interval": 100,
    "checkpointing_steps": 200,
    "evaluation_steps": 200,
    "max_train_steps": null,
    "epoch_checkpointing": true,
    "shuffle_before_split": false,
    "early_stopping": true,
    "early_stopping_stall_num": 5,
    "saving_limit": 5
}